app/controllers/tasks_controller.rb

  def index
    @task = Task.new

    if params.key?('q')
      @archived = nil
      @query = params['q']

      @tasks = Task.where(
        Task.arel_table[:title].matches(@query).or(
          Task.arel_table[:description].matches(@query)
        )
      )
    else
      @tasks = Task.all

      @archived = params.key?('archived') && params['archived'] == 'true'
      @tasks.where!(archived: true) if @archived
---
SELECT "tasks".* FROM "tasks" WHERE (("tasks"."title" LIKE 'Add' OR "tasks"."description" LIKE 'Add'))
SELECT "tasks".* FROM "tasks" WHERE "tasks"."archived" = 'f'

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 28 Jun 2014 07:36:39 UTC +00:00], ["description", ""], ["title", ""], ["updated_at", Sat, 28 Jun 2014 07:36:39 UTC +00:00]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = 20  [["complete", false], ["updated_at", Thu, 26 Jun 2014 03:35:19 UTC +00:00]]

  def archive
    @task = set_task
    if @task.update_attributes(archived: true)
---
UPDATE "tasks" SET "archived" = ?, "updated_at" = ? WHERE "tasks"."id" = 20  [["archived", true], ["updated_at", Tue, 24 Jun 2014 20:29:24 UTC +00:00]]

  def complete
    @task = set_task
    if @task.update_attributes(complete: true)
---
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = 22  [["complete", true], ["updated_at", Thu, 26 Jun 2014 01:59:25 UTC +00:00]]